#+TITLE: Abschlussprojekt Grundlagen Algorithmen  
#+SUBTITLE: Using Brute Force to sorting fictitious linear epitopes  
#+AUTHOR: Ricardo A. Orbegozo-Medina  
#+DATE: 23-02-2026  
#+LANGUAGE: en  
#+OPTIONS: toc:t num:t \n:t 

# % -------------- LATEX SETUP --------------
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
# % Margings: asymmetric for book-style layout
#+LATEX_HEADER: \usepackage[a4paper,inner=1.5in,outer=1.2in,top=0.8in,bottom=0.8in,includehead,headheight=15pt,twoside]{geometry}

# % Font setup: 
#+LATEX_HEADER: \usepackage{fontspec}                                  % set custom fonts
#+LATEX_HEADER: \setmainfont[Ligatures=TeX,Scale=1]{Liberation Sans}   % text font+size
#+LATEX_HEADER: \setmonofont[Ligatures=TeX,Scale=0.8]{Source Code Pro} % code font+size

# % --- Paragraph spacing: ---
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \setlength{\parskip}{0em}   % or 0.3em, 0.2em, etc.
#+LATEX_HEADER: \setlength{\parindent}{0pt}   % remoce paragraph indentation (sangria)
# remove indentation at the beggining of paragraphs
#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \AtBeginEnvironment{document}{\justifying}
#+LATEX_HEADER: \usepackage{ragged2e}
#+LATEX_HEADER: \justifying

# % --- generate table of content (xelatex) ---
# % white page before toc
#+LATEX: \clearpage
#+LATEX: \thispagestyle{empty}
#+LATEX: \null
# #+LATEX: \newpage
# #+BEGIN_EXPORT latex
# \tableofcontents
# #+END_EXPORT
# #+LATEX: \clearpage
# % --- Color Support ---
#+LATEX_HEADER: \usepackage[x11names,svgnames,dvipsnames]{xcolor}
# --- 10 colores importantes ---
#+LATEX_HEADER: % Definir colores faltantes y fallback seguro
#+LATEX_HEADER: \definecolor{Gray30}{gray}{0.30} % define Gray30 como 30% negro
#+LATEX_HEADER: \definecolor{Gray50}{gray}{0.50} % (opcional) ejemplo adicional
#+LATEX_HEADER: \colorlet{basictextcolor}{Black!70}          % texto normal
#+LATEX_HEADER: \colorlet{keywordcolor}{DodgerBlue3!90}      % palabras clave
**  Definition of fictitious epitopes using one letetr code

#+BEGIN_SRC R :results output :exports both
aa <- c(
  "A",  # Alanine
  "C",  # Cysteine
  "D",  # Aspartic acid
  "E",  # Glutamic acid
  "F",  # Phenylalanine
  "G",  # Glycine
  "H",  # Histidine
  "I",  # Isoleucine
  "K",  # Lysine
  "L",  # Leucine
  "M",  # Methionine
  "N",  # Asparagine
  "P",  # Proline
  "Q",  # Glutamine
  "R",  # Arginine
  "S",  # Serine
  "T",  # Threonine
  "V",  # Valine
  "W",  # Tryptophan
  "Y"   # Tyrosine
)
# generate epitope lengths randomnly between 4 to 7 residues
epitope_lengths <- sample(4:7, 6, replace=TRUE) # samples will be replaced each time
# Generate random epitopes
epitopes <- sapply(epitope_lengths, function(len) {
  paste0(sample(aa, len, replace = TRUE), collapse = "")
})
epitopes # show result sequences
nchar(epitopes) # show number of residues per sequence
#+END_SRC

#+RESULTS:
: [1] "MQKFTEP" "THWTVFK" "HIITTV"  "CSPEDT"  "NALP"    "EEMGVGH"
: [1] 7 7 6 6 4 7

#+LATEX: \clearpage
** Function: Insertion Sort by Length

#+BEGIN_SRC R :results output :exports both
insertion_sort_epitopes <- function(x) {
  steps = list() # keep rack of each (intermediate) step
  n = length(x) # how many aa's
  steps[[1]] = x # save unsorted vector
  step_idx = 2  # start from second element
  for (i in 2:n) { # iterate vector
    key = x[i] # peptide to be sorted
    key_len = nchar(key) # peptide length
    j = i - 1 # start from backwards 
    while (j > 0 && nchar(x[j]) > key_len) {
      x[j + 1] = x[j] # move peptide to the right
      j = j - 1 # or keep moving to the left
    }
    x[j + 1] = key # drop the peptide in the right spot
    steps[[step_idx]] = x # save this step
    step_idx = step_idx + 1 # increment index by one
  }
  
  list(sorted = x, steps = steps) # return sorted epitope vector and steps
}

res = insertion_sort_epitopes(epitopes) # apply function to epitopes
res$sorted # show sorted epitopes
#+END_SRC

#+RESULTS:
: [1] "NALP"    "HIITTV"  "CSPEDT"  "MQKFTEP" "THWTVFK" "EEMGVGH"

#+LATEX: \clearpage
** Results
Visualize intermediate states of this algorithm:

#+BEGIN_SRC R :results output :exports both
res$steps # show intermediate steps
#+END_SRC

#+RESULTS:
#+begin_example
[[1]]
[1] "MQKFTEP" "THWTVFK" "HIITTV"  "CSPEDT"  "NALP"    "EEMGVGH"

[[2]]
[1] "MQKFTEP" "THWTVFK" "HIITTV"  "CSPEDT"  "NALP"    "EEMGVGH"

[[3]]
[1] "HIITTV"  "MQKFTEP" "THWTVFK" "CSPEDT"  "NALP"    "EEMGVGH"

[[4]]
[1] "HIITTV"  "CSPEDT"  "MQKFTEP" "THWTVFK" "NALP"    "EEMGVGH"

[[5]]
[1] "NALP"    "HIITTV"  "CSPEDT"  "MQKFTEP" "THWTVFK" "EEMGVGH"

[[6]]
[1] "NALP"    "HIITTV"  "CSPEDT"  "MQKFTEP" "THWTVFK" "EEMGVGH"
#+end_example

# We can also organize these states in a table:
# 
# #+BEGIN_SRC R :results output :exports both
# max_length <- max(sapply(steps, length))
# step_mat <- do.call(rbind, lapply(steps, function(v) {
#   length(v) <- max_length
#   v
# }))
# colnames(step_mat) <- paste0("Pos", 1:max_length)
# rownames(step_mat) <- paste0("Step", 0:(nrow(step_mat)-1))
# step_mat
# #+END_SRC
# 
# #+RESULTS:
# : Pos1      Pos2      Pos3      Pos4      Pos5      Pos6     
# : Step0 "MQKFTEP" "THWTVFK" "HIITTV"  "CSPEDT"  "NALP"    "EEMGVGH"
# : Step1 "MQKFTEP" "THWTVFK" "HIITTV"  "CSPEDT"  "NALP"    "EEMGVGH"
# : Step2 "HIITTV"  "MQKFTEP" "THWTVFK" "CSPEDT"  "NALP"    "EEMGVGH"
# : Step3 "HIITTV"  "CSPEDT"  "MQKFTEP" "THWTVFK" "NALP"    "EEMGVGH"
# : Step4 "NALP"    "HIITTV"  "CSPEDT"  "MQKFTEP" "THWTVFK" "EEMGVGH"
# : Step5 "NALP"    "HIITTV"  "CSPEDT"  "MQKFTEP" "THWTVFK" "EEMGVGH"

